## Pandas

In [10]:
import pandas as pd

#### Series

A Series is a one-dimensional labeled array in Pandas.

You can think of it as a single column in an Excel sheet or a SQL table.

It has two parts:

Values → the actual data (numbers, strings, booleans, etc.)

Index → labels for each value (like row numbers in Excel, but customizable).

In [16]:
data = [1,2,3,4,5,6,7,8,9]
series = pd.Series(data)
print("Series \n" , series)
print(type(series))

Series
 0    1
1    2
2    3
3    4
4    5
5    6
6    7
7    8
8    9
dtype: int64
<class 'pandas.core.series.Series'>

#### Create a series from dictionary

Here the Default index is the (0 , 1 , 2, ... 8)

In [25]:
data = {
    'a' : 1 , 
    'b' : 2 , 
    'c' : 3 , 
}
series_dict = pd.Series(data)
print(series_dict)
print(type(series_dict))

a    1
b    2
c    3
dtype: int64
<class 'pandas.core.series.Series'>

But here in the dictinoary the default index has changed to the a , b ,c , Basically the 
keys in the dictionary becomes the index in the series

### We can give our own custom index as well

In [30]:
data = [10,20,30]
index_list= ['a' , 'b' , 'c']
series = pd.Series(data , index = index_list)
print(series)

a    10
b    20
c    30
dtype: int64

## DataFrame

#### create a Dataframe from dictionary of list

In [37]:
data = {
    'Name' : ['Krish' , 'john' , 'jack'] , 
    'Age' : [30 , 42 , 80] , 
    'City' : ['Banglore' , 'Newyork' ,'Florida']
}
df =  pd.DataFrame(data)
print(df)

    Name  Age      City
0  Krish   30  Banglore
1   john   42   Newyork
2   jack   80   Florida

In [39]:
df

    Name  Age      City
0  Krish   30  Banglore
1   john   42   Newyork
2   jack   80   Florida

#### we can also convert the dataframe into the 2-D array

In [46]:
import numpy as np 
arr_data = np.array(df)
arr_data

array([['Krish', 30, 'Banglore'],
       ['john', 42, 'Newyork'],
       ['jack', 80, 'Florida']], dtype=object)

All the keys in the dictionary or we can say the column name in the dataframe get removed
while converting the dataframe to the 2-array